docs/wm.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-01 Sat 11:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Alexander Brown" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href=" ./style.css" />
</head>
<body>
<div id="preamble" class="status">
<a href="index.html">Home</a> | <a href="blog.html">Blog</a> | <a href="notes.html">Notes</a> | <a href="classes.html">Classes</a> | <a href="projects.html">Projects</a> | <a href="todo.html">Todo</a> | <a href="error.html">About</a>
</div>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#writing-a-x-window-manager">1. Writing a X Window Manager</a>
<ul>
<li><a href="#window-hierarchy">1.1. Window Hierarchy</a></li>
<li><a href="#substructure-redirection">1.2. Substructure Redirection</a></li>
<li><a href="#reparenting">1.3. Reparenting</a></li>
</ul>
</li>
<li><a href="#sources">2. Sources</a></li>
</ul>
</div>
</div>
<div id="outline-container-writing-a-x-window-manager" class="outline-2">
<h2 id="writing-a-x-window-manager"><span class="section-number-2">1.</span> Writing a X Window Manager</h2>
<div class="outline-text-2" id="text-writing-a-x-window-manager">
</div>
<div id="outline-container-window-hierarchy" class="outline-3">
<h3 id="window-hierarchy"><span class="section-number-3">1.1.</span> Window Hierarchy</h3>
<div class="outline-text-3" id="text-window-hierarchy">
<p>
Windows are organized into a tree hierarchy. The root of the hierarchy
is the root window, a virtual, invisible window that ha the same size as
the screen and is always present. Top level windows are direct children
of the root window. UI elements within a top level window are
descendants of that window. This hierarchy also enforces that the child
is clipped to the boundaries of its parent.
</p>
</div>
</div>

<div id="outline-container-substructure-redirection" class="outline-3">
<h3 id="substructure-redirection"><span class="section-number-3">1.2.</span> Substructure Redirection</h3>
<div class="outline-text-3" id="text-substructure-redirection">
<p>
Substructure redirection is the mechanism that allows a window manager
to intercept requests to draw window decorations, resize, etc. A window
manager must subscribe to <i>substructure redirection</i> on the root window
so that all requests are passed through the window manager.
</p>
</div>
</div>

<div id="outline-container-reparenting" class="outline-3">
<h3 id="reparenting"><span class="section-number-3">1.3.</span> Reparenting</h3>
<div class="outline-text-3" id="text-reparenting">
<p>
The process of reparenting is what allows windows frames to be drawn
(max, min, hide buttons). When a window is created, the window manager
is notified and makes the window a child of a frame generated by the
window manager. Because the window is no longer a direct descendent from
the root window the window manager cannot modify it UNLESS it has also
registed for substructure redirection on each frame window it creates.
</p>
</div>
</div>
</div>

<div id="outline-container-sources" class="outline-2">
<h2 id="sources"><span class="section-number-2">2.</span> Sources</h2>
<div class="outline-text-2" id="text-sources">
<p>
<a href="https://jichu4n.com/posts/how-x-window-managers-work-and-how-to-write-one-part-i/.md">How
X Window Managers Work, And How To Write One</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alexander Brown</p>
<p class="date">Created: 2023-04-01 Sat 11:11</p>
</div>
</body>
</html>
